{
  "name":"So Love Autistic Center",
  "lat":39.9451592,
  "long":-75.2985101,
  "image_file":null,
  "organization":"So Love Autistic Center",
  "contact":"jlion@haverford.edu",
  "haverford_office":"Janice Lion",
  "description":"<p style=\"margin:0in 0in 10pt\"><span style=\"font-size:11pt\"><span style=\"line-height:115%\"><span style=\"font-family:&quot;Calibri&quot;,&quot;sans-serif&quot;\">So Love Autistic Center provides educational and therapeutic services with extended childcare hours for working parents. Their flexible scheduling allows families to maintain services in other therapeutic settings, which promotes continuity of care and access to &ldquo;fill in the gap&rdquo; childcare services. A comprehensive, early learning curriculum is partnered with the Early Start Denver Model (ESDM), an ABA based approach that delivers therapeutic goals across developmental domains. ESDM techniques engage children in positive emotional experiences with another person and draw the child&rsquo;s attention to social stimuli.<br />\r\n<br />\r\nThe center delivers these techniques in the context of a play-based, natural learning environment. So Love Autistic Center along with the ESDM&rsquo;s goal is to empower children with ASD to become active participants in the world by initiating interactions with others. Additional ABA based approaches are incorporated to meet each child&rsquo;s individual needs.<br />\r\n<br />\r\nSo Love Autistic Center is an organization with a commitment to empowering the families we serve, affording them a consistent opportunity to contribute to the marketplace and expand their ability to support their family, by relieving the burden of needing adequate and developmentally appropriate childcare services for their autistic child.</span></span></span></p>\r\n\r\n<p><a href=\"https://www.solovecenter.org/\">https://www.solovecenter.org/</a></p>",
  "start_date":null,
  "end_date":null,
  "categories":[
    {
      "Type":[
        "volunteer",
        "fellowship"
      ]
    },
    {
      "Area":[
        "Community Development",
        "Disability Accessibility",
        "Education"
      ]
    },
    {
      "Language":[

      ]
    },
    {
      "Region":[
        "Philadelphia Area"
      ]
    },
    {
      "Subject":[
        "Psychology\n"
      ]
    },
    {
      "Keyword":[

      ]
    }
  ],
  "publish":true,
  "geo_json":null
}