{
  "name":"The Lenape Nation of PA",
  "lat":null,
  "long":null,
  "image_file":null,
  "organization":null,
  "contact":"jlion@haverford.edu",
  "haverford_office":"Janice Lion",
  "description":"<p>The Lenape Nation of Pennsylvania is a 501(c)(3) non-profit organization dedicated to increasing awareness of Lenape history and culture. Created to join together the members of the Lenape Nation and anyone else interested in continuing the development of the language and culture of the Lenape people, the Lenape Nation of Pennsylvania is active in the revival of tradition and community. We encourage partnerships among people and organizations in order to foster cultural, historical, and environmental education and preservation.</p>\r\n\r\n<p><br />\r\nThe Lenape people are the original inhabitants of Delaware, New Jersey, Eastern Pennsylvania, and Southern New York. For over 10,000 years they have been the caretakers of these lands and of The River of Human Beings, more commonly known as the Delaware River. The Lenape were the first tribe to sign a treaty with the United States and the first tribe to have land set aside for them in New Jersey.</p>\r\n\r\n<p>Over a period of 250 years, many Lenape people were removed and dispersed throughout the country. Some took refuge with other tribes. A large number of Lenape families remained in the homelands and continue the traditions of their ancestors up to our present day. Today the Lenape people from all over Turtle Island (North America) are revitalizing their communities.</p>\r\n\r\n<p><strong>Partnership Description</strong></p>\r\n\r\n<p>Adam DePaul has given several talks and discussions on Lenape culture, language, and history sponsored or co-sponsored by CPGC. He has also worked with the OMA, Quaker Affairs, and the Library in addition to the curricular connections below.</p>\r\n\r\n<p>&nbsp;</p>",
  "start_date":null,
  "end_date":null,
  "categories":[
    {
      "Type":[

      ]
    },
    {
      "Area":[
        "Community Development",
        "Education",
        "Human Rights",
        "Intercultural Issues",
        "Arts & Culture"
      ]
    },
    {
      "Language":[

      ]
    },
    {
      "Region":[

      ]
    },
    {
      "Subject":[

      ]
    },
    {
      "Keyword":[

      ]
    }
  ],
  "publish":false,
  "geo_json":null
}