{
  "name":"Grupo de Apoyo Mutuo",
  "lat":14.6432223,
  "long":-90.5095016,
  "image_file":null,
  "organization":"Grupo de Apoyo Mutuo",
  "contact":"bgettleson@haverford.edu",
  "haverford_office":"Brie Gettleson",
  "description":"<p><meta charset=\"utf-8\" /><b id=\"docs-internal-guid-dcf268f6-7fff-5b6e-9766-bff9ac03ee60\"><img src=\"https://lh6.googleusercontent.com/OBtzIE8W1-PS8v-r0klSzT6dEH-EnbREftpCjtM4YfnzX_WUbvvKlwIiYlsr3o2Pc_XrQTSeh9xYW2Q3Kc9CtDwydH24ETh_gBAwMUXOiuFDbkSzRm5sLv1m0iu3nUjxj3ftV9Oz\" style=\"width: 334px; height: 250px;\" /></b></p>\r\n\r\n<p>Pictured: Haverford students presenting in Antigua, Guatemala with members of the GAM</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>The Grupo de Apoyo Mutuo is Guatemala&#39;s longest-running human rights organization. They are a civil society organization whose scope of work includes justice for the disappeared during Guatemala&#39;s internal armed conflict and the dignification of victims. The GAM also prepare thematic reports related to current violence rates and monitor the institutions that make up the security and justice sector in Guatemala.</p>\r\n\r\n<p>Since 2017, Haverford College Libraries and the Grupo de Apoyo Mutuo have been in a partnership to create and maintain the Grupo de Apoyo Mutuo (GAM) Digital Archive. The partnership is a collaborative digitization project that preserves and provides access to over 3,300 case files of disappearances tied to Guatemala&rsquo;s armed internal conflict. The project involves students, scholars, and human rights activists in building a digital archive and sharing knowledge that can shift historical memory of the conflict. The work is based on a post-custodial model where materials stay in Guatemala and Haverford provides technical knowledge and resources. Haverford students--in particular the Digital Scholarship Compa&ntilde;eros--have been central to the creation and utilization of the archive since the collaboration began. In the summer of 2019, three students traveled to Guatemala to work in the GAM offices and conduct independent research. In turn, members from the Grupo de Apoyo Mutuo have traveled to Haverford College to share their work with the campus community.</p>",
  "start_date":null,
  "end_date":null,
  "categories":[
    {
      "Type":[
        "fellowship",
        "internship",
        "partner"
      ]
    },
    {
      "Area":[
        "Government",
        "Human Rights",
        "Civil Rights",
        "Intercultural Issues",
        "Law",
        "Racism",
        "Technology",
        "Research"
      ]
    },
    {
      "Language":[

      ]
    },
    {
      "Region":[
        "Guatemala\n"
      ]
    },
    {
      "Subject":[

      ]
    },
    {
      "Keyword":[

      ]
    }
  ],
  "publish":true,
  "geo_json":null
}