{
  "name":"Cherry Buttons Women's Co-op; and the Center for the Qualification and Formation of Women",
  "lat":33.8305244,
  "long":-4.8353154,
  "image_file":null,
  "organization":"Cherry Buttons Women's Co-op; and the Center for the Qualification and Formation of Women",
  "contact":"szukerma@haverford.edu",
  "haverford_office":"Stephanie Zukerman",
  "description":"<p>There are two organizations at this site:<br />\r\n<br />\r\nCherry Buttons Co-op: We are a women&#39;s cooperative based in Sefrou, Morocco. We specialize in traditional jewelry and accessories handmade with natural materials. The cooperative engages in many regional and national social activities which help improve the lives of rural Moroccan women through economic independence. ​​<br />\r\n<br />\r\nThe Center for the Qualification and Formation of Women: The Center is made specifically for women who have difficulty in their community. They come to the Center in order to get a diploma; it would be difficulty for them to get a diploma elsewhere. Women are from Sefrou and surrounding country-side.&nbsp; It&#39;s about building women up and giving them qualifications.&nbsp;They learn skillsets ranging from language, computer skills, cooking, aesthetics, sewing, etc.</p>\r\n\r\n<p>Each summer two fellows teach either English or French language as well as basic computer skills to local women who have had a difficult life, e.g.&nbsp;those who have been imprisoned and want to change their life, divorced women who are not accepted by their community, single mothers, elderly. Interns will spend some time at the women&#39;s co-op as well, and one male Haverford student works at a youth center teaching language, sports, and/or music.</p>\r\n\r\n<p><img alt=\"\" src=\"/media/media/2018/12/20/englishclass6_zukerman_morocco_2018.JPG\" style=\"width: 300px; height: 225px;\" /></p>\r\n\r\n<p><a data-saferedirecturl=\"https://www.google.com/url?q=https://www.cherrybuttonscooperative.com/&amp;source=gmail&amp;ust=1545428782293000&amp;usg=AFQjCNEkl8KvRW9I5UpSFzvHt0jidkaglg\" href=\"https://www.cherrybuttonscooperative.com/\" target=\"_blank\">https://www.<wbr />cherrybuttonscooperative.com/</a></p>",
  "start_date":null,
  "end_date":null,
  "categories":[
    {
      "Type":[
        "fellowship"
      ]
    },
    {
      "Area":[
        "Community Development",
        "Cooperative Solidarity Economy",
        "Education",
        "Gender & Sexuality",
        "Intercultural Issues"
      ]
    },
    {
      "Language":[

      ]
    },
    {
      "Region":[
        "Morocco\n"
      ]
    },
    {
      "Subject":[

      ]
    },
    {
      "Keyword":[

      ]
    }
  ],
  "publish":true,
  "geo_json":null
}