{
  "name":"Asa Wright Nature Center",
  "lat":10.617186,
  "long":-61.2743688,
  "image_file":null,
  "organization":"Asa Wright Nature Center",
  "contact":"szukerma@haverford.edu",
  "haverford_office":"Stephanie Zukerman",
  "description":"<p>The AWNC is a &quot;Not-for-Profit&quot; Trust established in 1967 by a group of naturalists and bird-watchers to &quot;protect part of the Arima Valley in a natural state and to create a conservation and study area for the protection of wildlife and for the enjoyment of all.&quot; It was one of the first nature centers to be established in the Caribbean. Comprising nearly 1,500 acres of mainly forested land in the Arima and Aripo Valleys of the Northern Range, the AWNC&#39;s properties will be retained under forest cover in perpetuity, to protect the community watershed and provide important wildlife habitat. The AWNC has developed its efforts in three major areas: Education, Conservation, and Ecotourism. It is now widely recognized as one of the most successful ecotourism stories in the world.</p>\r\n\r\n<p>AWNC hosts 1 Bi-co fellow each summer to work under the supervision of their conservation officer. The fellow lives at the AWNC working on conservation and education programs designed to increase the awareness and support local people for conservation of the native wildlife, and to facilitate sustainable development in the communities surrounding the Nature Center. They also hosts 10 students for 2 nights as part of professor Jon Wilson&#39;s Economic Botany spring break field study.</p>\r\n\r\n<p><a data-saferedirecturl=\"https://www.google.com/url?q=http://asawright.org/&amp;source=gmail&amp;ust=1545428781563000&amp;usg=AFQjCNHK9cSwNa5R1Li8icCxIMY5Xt3FXg\" href=\"http://asawright.org/\" target=\"_blank\">http://asawright.org/</a></p>",
  "start_date":null,
  "end_date":null,
  "categories":[
    {
      "Type":[
        "fellowship"
      ]
    },
    {
      "Area":[
        "Education",
        "Environment",
        "Research",
        "Sustainability"
      ]
    },
    {
      "Language":[

      ]
    },
    {
      "Region":[
        "Trinidad and Tobago\n"
      ]
    },
    {
      "Subject":[
        "Economic Botany"
      ]
    },
    {
      "Keyword":[

      ]
    }
  ],
  "publish":true,
  "geo_json":null
}