{
  "name":"Titagya School",
  "lat":9.4034226,
  "long":-0.842416,
  "image_file":null,
  "organization":"Titagya School",
  "contact":"szukerma@haverford.edu",
  "haverford_office":"Stephanie Zukerman",
  "description":"<p>&ldquo;Titagya&rdquo; means &ldquo;we have changed&rdquo; in Dagbani (the local language in much of northern Ghana), and we are dedicated to changing young people&rsquo;s lives by increasing the quality and availability of early education in this region of 4 million people. We operate high-impact pre-schools &amp; kindergartens, train early education-level teachers in a more interactive pedagogy, and partner with the government to scale up the number of high-quality pre-schools and kindergartens in the North. We currently operate four schools serving 300 students, which serve as demonstration labs for public schools. By collaborating with the government to increase the number and quality of pre-schools and kindergartens, we are aiming to improve the lifetime opportunities for the roughly 400,000 children between the ages of 3-5.</p>\r\n\r\n<p>CPGC and BMC&#39;s LILAC partner to send up to 6 students to Dalun, Ghana as part of the Lagim Tehi Tuma (&quot;Thinking Together&quot; in Dagbani) Summer Fellowship. At Titagya, fellows assist in prekindergarten or kindergarten classrooms, collaborate on curriculum units, and assist with Family Day. They also learn and think together about the workings of a transnational NGO.</p>\r\n\r\n<p><img alt=\"\" src=\"/media/media/2018/12/20/ianogolla1-1.jpg\" style=\"width: 300px; height: 225px;\" /></p>\r\n\r\n<p><a data-saferedirecturl=\"https://www.google.com/url?q=http://titagyaschools.org/&amp;source=gmail&amp;ust=1545428781550000&amp;usg=AFQjCNFC90VVcNiJWTx_Mat8TmgosnncGA\" href=\"http://titagyaschools.org/\" target=\"_blank\">http://titagyaschools.org/</a></p>",
  "start_date":null,
  "end_date":null,
  "categories":[
    {
      "Type":[
        "fellowship"
      ]
    },
    {
      "Area":[
        "Children",
        "Education"
      ]
    },
    {
      "Language":[

      ]
    },
    {
      "Region":[
        "Ghana\n"
      ]
    },
    {
      "Subject":[
        "Education\n"
      ]
    },
    {
      "Keyword":[

      ]
    }
  ],
  "publish":true,
  "geo_json":null
}