{
  "name":"Lagim Tehi Tuma",
  "lat":7.946527,
  "long":-1.023194,
  "image_file":null,
  "organization":"Lagim Tehi Tuma",
  "contact":"szukerma@haverford.edu",
  "haverford_office":"Stephanie Zukerman",
  "description":"<p>Lagim Tehi Tuma (&ldquo;Thinking Together&rdquo; in Dagbani), is a Bi-Co fellowship with the community of Dalun, Ghana that combines intensive team-building, collaborative study, and education-focused projects to foster dialogue through which participants think together about culture, power, history, and learning. This process entails engagement with questions of race, class, gender, and other dimensions of identity; of colonialism, nationality, and postcoloniality; and of the discourses of development, postdevelopment and indigeneity. This program approaches community-based work from multiple centers: American and Ghanaian, academic and community-based, English and Dagbani, formal and informal contexts of learning and teaching.<br />\r\n<br />\r\nLed by Professor Alice Lesnick and Dalun- and BiCo-based Coordinators, and in collaboration with the University of Development Studies in Tamale, students and community mentors work on small, temporary projects in initiatives already underway in Dalun. The goal is through shared work and study to think together such that all parties gain awareness and new questions, which often entails unlearning received knowledge and shifting received frameworks for understanding as these are part of the issues in focus.</p>\r\n\r\n<p>CPGC and BMC&#39;s LILAC support 6 fellows each summer to be part of the Lagim Tehi Tuma program. Fellows can intern at one of the following sites: 1) Titagya Schools (Early Childhood Education in Dalun), 2) Simli Radio (Community Radio Projects), 3) Dalun ICT Center (Community and Computer-based Learning), or 4) Dalun Cultural Group (learning traditional drumming and dance).</p>\r\n\r\n<p><a data-saferedirecturl=\"https://www.google.com/url?q=http://lagim.blogs.brynmawr.edu/&amp;source=gmail&amp;ust=1545428781355000&amp;usg=AFQjCNGkzyzp-HZea7wnYpF3AWzC6tgUaw\" href=\"http://lagim.blogs.brynmawr.edu/\" target=\"_blank\">http://lagim.blogs.brynmawr.<wbr />edu/</a></p>",
  "start_date":null,
  "end_date":null,
  "categories":[
    {
      "Type":[
        "fellowship"
      ]
    },
    {
      "Area":[
        "Children",
        "Community Development",
        "Education",
        "Arts & Culture"
      ]
    },
    {
      "Language":[

      ]
    },
    {
      "Region":[
        "Ghana\n"
      ]
    },
    {
      "Subject":[
        "Education\n"
      ]
    },
    {
      "Keyword":[

      ]
    }
  ],
  "publish":true,
  "geo_json":null
}