{
  "name":"La Casa de los Amigos",
  "lat":19.2464696,
  "long":-99.1013498,
  "image_file":null,
  "organization":"La Casa de los Amigos",
  "contact":"szukerma@haverford.edu",
  "haverford_office":"Stephanie Zukerman",
  "description":"<p>Casa de los Amigos, A.C. is a Center for Peace and International Understanding in Mexico City. The Casa was established as a nonprofit organization in 1956 by the Quaker community in Mexico, and its work continues to be rooted in Quaker values. Through its programs, community space, and social and cultural activities, the Casa promotes peace with justice, fosters understanding between groups and individuals, and supports the human dignity of every person.</p>\r\n\r\n<p>This 10-week experiential learning internship offers six Haverford and Bryn Mawr College students an incredible opportunity to work for peace and social justice while living in an intentional community in the heart of Mexico City. Selected students can split their time between the Casa de los Amigos, a Quaker center for peace and international understanding, and another social justice organization in the city. The Mexico City orientation includes several days of training to contextualize the Casa&rsquo;s work, Mexican history, politics, and participating in an in-depth orientation on issues of economic justice, asylum, and the roots and realities of poverty and migration culture that will be led by the Casa&rsquo;s full-time staff and other full-time volunteers.</p>\r\n\r\n<p><img alt=\"\" src=\"/media/media/2018/12/20/casa-1.jpg\" style=\"width: 300px; height: 169px;\" /></p>\r\n\r\n<p><a data-saferedirecturl=\"https://www.google.com/url?q=https://www.casadelosamigos.org/en/&amp;source=gmail&amp;ust=1545428779344000&amp;usg=AFQjCNHLxOOvLOr_i4yk7b16qGYHV4XzBA\" href=\"https://www.casadelosamigos.org/en/\" target=\"_blank\">https://www.casadelosamigos.<wbr />org/en/</a></p>",
  "start_date":null,
  "end_date":null,
  "categories":[
    {
      "Type":[
        "fellowship"
      ]
    },
    {
      "Area":[
        "Law",
        "Intercultural Issues",
        "Human Rights",
        "Gender & Sexuality",
        "Education",
        "Globalization",
        "Cooperative Solidarity Economy",
        "Community Development",
        "Children",
        "Immigration"
      ]
    },
    {
      "Language":[

      ]
    },
    {
      "Region":[
        "Mexico\n"
      ]
    },
    {
      "Subject":[

      ]
    },
    {
      "Keyword":[

      ]
    }
  ],
  "publish":true,
  "geo_json":null
}