{
  "name":"Center for Creative Works",
  "lat":40.0038732,
  "long":-75.282685,
  "image_file":null,
  "organization":"Center for Creative Works",
  "contact":"sbursese@haverford.edu",
  "haverford_office":"Stephanie Bursese",
  "description":"<p>The Center for Creative Works is a unique work environment with a goal of developing creative work potential and cultural identity for people with intellectual disabilities.<br />\r\n​<br />\r\nCreative Works combines supported studio art development with work opportunities-including supported employment options &ndash; and community programming. Participants learn and work in drawing and painting, printmaking, ceramics, woodworking, sculpture, textiles, design, music and other media. A staff of mentor artists teach professional materials and techniques, with the goal of developing participants as artists, artisans, and designers. We foster individual expression and skill development, promoting our artists&rsquo; work through public exhibitions, art fairs, and other events in the community.<br />\r\n​<br />\r\nOur fully engaged program includes many options for inclusion, growth, exploration and development of individual talents and skills within each person. CCW is committed to realizing potential for everyone to contribute in truly meaningful and productive ways, and to support our artists in building their cultural identity as members of their community.</p>\r\n\r\n<p><a data-saferedirecturl=\"https://www.google.com/url?q=https://www.centerforcreativeworks.org&amp;source=gmail&amp;ust=1545430692439000&amp;usg=AFQjCNEhH8sIF73xIHGGSTPCtIGQXKp6Fg\" href=\"https://www.centerforcreativeworks.org\" target=\"_blank\">https://www.<wbr />centerforcreativeworks.org</a></p>",
  "start_date":null,
  "end_date":null,
  "categories":[
    {
      "Type":[
        "volunteer",
        "residency"
      ]
    },
    {
      "Area":[
        "Community Development",
        "Disability Accessibility",
        "Intercultural Issues",
        "Arts & Culture"
      ]
    },
    {
      "Language":[

      ]
    },
    {
      "Region":[
        "Philadelphia Area"
      ]
    },
    {
      "Subject":[

      ]
    },
    {
      "Keyword":[

      ]
    }
  ],
  "publish":true,
  "geo_json":null
}